<template>
    <div class="big-wrapper">
        <Header />
        <div class="wrapper">
            <main class="main">
                <BreadCrumbsVue :text="BreadCrumbsLink"/>
                <section class="main__about about">
                    <div class="container">
                        <h1 class="about__title">
                            Наша команда
                        </h1>
                        <p class="about__text">
                            Мы - команда профессионалов в области парфюмерии, которые страстно увлечены всеми аспектами этой
                            красивой и увлекательной индустрии. <br> <br>
                            Наша миссия заключается в том, чтобы делиться с вами своими знаниями и опытом, чтобы вы могли
                            наслаждаться всеми прекрасными ароматами, которые мир может предложить.
                        </p>
                        <div class="about__inner">
                            <div class="about__item about-item about-item--colored">
                                <img class="about-item__img" src="../../public/About/about-img-1.png" alt="img">
                                <p class="about-item__name">
                                    Илья Мазелов
                                </p>
                                <p class="about-item__post">
                                    SMM-менеджер
                                </p>
                                <div class="about-item__socials">
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M5.33073 5.33398H26.6641C28.1307 5.33398 29.3307 6.53398 29.3307 8.00065V24.0007C29.3307 25.4673 28.1307 26.6673 26.6641 26.6673H5.33073C3.86406 26.6673 2.66406 25.4673 2.66406 24.0007V8.00065C2.66406 6.53398 3.86406 5.33398 5.33073 5.33398Z"
                                                stroke="black" stroke-width="2.66667" stroke-linecap="round"
                                                stroke-linejoin="round" />
                                            <path d="M29.3307 8L15.9974 17.3333L2.66406 8" stroke="black"
                                                stroke-width="2.66667" stroke-linecap="round" stroke-linejoin="round" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M6.27295 4.66602C5.38439 4.66602 4.66406 5.38634 4.66406 6.2749V25.7237C4.66406 26.6123 5.38439 27.3326 6.27295 27.3326H25.7218C26.6104 27.3326 27.3307 26.6123 27.3307 25.7237V6.2749C27.3307 5.38634 26.6104 4.66602 25.7218 4.66602H6.27295ZM9.75169 11.7052C10.8377 11.7052 11.718 10.8248 11.718 9.73883C11.718 8.65286 10.8377 7.7725 9.75169 7.7725C8.66572 7.7725 7.78536 8.65286 7.78536 9.73883C7.78536 10.8248 8.66572 11.7052 9.75169 11.7052ZM13.5188 13.1583H16.7777V14.6512C16.7777 14.6512 17.662 12.8826 20.0681 12.8826C22.2145 12.8826 23.9926 13.9399 23.9926 17.1628V23.959H20.6155V17.9863C20.6155 16.0851 19.6005 15.876 18.827 15.876C17.2218 15.876 16.947 17.2606 16.947 18.2343V23.959H13.5188V13.1583ZM11.4658 13.1583H8.03759V23.959H11.4658V13.1583Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M4 16C4 21.9333 8.33333 26.8667 14 27.8667L14.0669 27.8132C14.0446 27.8088 14.0223 27.8045 14 27.8V19.3333H11V16H14V13.3333C14 10.3333 15.9333 8.66667 18.6667 8.66667C19.5333 8.66667 20.4667 8.8 21.3333 8.93333V12H19.8C18.3333 12 18 12.7333 18 13.6667V16H21.2L20.6667 19.3333H18V27.8C17.9777 27.8045 17.9554 27.8088 17.9331 27.8132L18 27.8667C23.6667 26.8667 28 21.9333 28 16C28 9.4 22.6 4 16 4C9.4 4 4 9.4 4 16Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M26.3615 10.7842C26.3706 11.0174 26.3736 11.2505 26.3736 11.4836C26.3736 18.5532 21.4004 26.7147 12.3063 26.7147C9.51278 26.7147 6.91518 25.8243 4.72656 24.3087C5.11344 24.3511 5.50635 24.3829 5.90528 24.3829C8.22152 24.3829 10.3549 23.5242 12.0471 22.0827C9.88358 22.0509 8.05673 20.4929 7.42667 18.3731C7.72914 18.4367 8.04063 18.4685 8.35917 18.4685C8.80835 18.4685 9.24447 18.405 9.66249 18.2778C7.39851 17.7903 5.69326 15.6281 5.69326 13.0313C5.69326 12.9995 5.69326 12.9889 5.69326 12.9677C6.36049 13.3598 7.12419 13.6035 7.93512 13.6353C6.60668 12.6708 5.73343 11.028 5.73343 9.17311C5.73343 8.19799 5.97661 7.27583 6.40469 6.48089C8.84251 9.72422 12.4872 11.8547 16.5962 12.0773C16.5117 11.6851 16.4685 11.2718 16.4685 10.8585C16.4685 7.90131 18.6822 5.50586 21.4135 5.50586C22.8354 5.50586 24.1196 6.1525 25.021 7.19121C26.1495 6.95803 27.2066 6.5129 28.1633 5.89815C27.7925 7.14884 27.0096 8.19794 25.9867 8.85508C26.9875 8.72789 27.9422 8.44194 28.8275 8.01797C28.1633 9.08848 27.3272 10.0317 26.3615 10.7842Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                </div>
                                <p class="about-item__text">
                                    Наш SMM-менеджер - настоящий гений в мире социальных медиа! Он знает, как заставить
                                    контент работать на свою аудиторию и привлечь больше подписчиков, чем у котиков на
                                    YouTube.
                                </p>
                            </div>
                            <div class="about__item about-item about-item">
                                <img class="about-item__img" src="../../public/About/about-img-2.png" alt="img">
                                <p class="about-item__name">
                                    Катя Юрченко
                                </p>
                                <p class="about-item__post">
                                    Руководитель
                                </p>
                                <div class="about-item__socials">
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M5.33073 5.33398H26.6641C28.1307 5.33398 29.3307 6.53398 29.3307 8.00065V24.0007C29.3307 25.4673 28.1307 26.6673 26.6641 26.6673H5.33073C3.86406 26.6673 2.66406 25.4673 2.66406 24.0007V8.00065C2.66406 6.53398 3.86406 5.33398 5.33073 5.33398Z"
                                                stroke="black" stroke-width="2.66667" stroke-linecap="round"
                                                stroke-linejoin="round" />
                                            <path d="M29.3307 8L15.9974 17.3333L2.66406 8" stroke="black"
                                                stroke-width="2.66667" stroke-linecap="round" stroke-linejoin="round" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M6.27295 4.66602C5.38439 4.66602 4.66406 5.38634 4.66406 6.2749V25.7237C4.66406 26.6123 5.38439 27.3326 6.27295 27.3326H25.7218C26.6104 27.3326 27.3307 26.6123 27.3307 25.7237V6.2749C27.3307 5.38634 26.6104 4.66602 25.7218 4.66602H6.27295ZM9.75169 11.7052C10.8377 11.7052 11.718 10.8248 11.718 9.73883C11.718 8.65286 10.8377 7.7725 9.75169 7.7725C8.66572 7.7725 7.78536 8.65286 7.78536 9.73883C7.78536 10.8248 8.66572 11.7052 9.75169 11.7052ZM13.5188 13.1583H16.7777V14.6512C16.7777 14.6512 17.662 12.8826 20.0681 12.8826C22.2145 12.8826 23.9926 13.9399 23.9926 17.1628V23.959H20.6155V17.9863C20.6155 16.0851 19.6005 15.876 18.827 15.876C17.2218 15.876 16.947 17.2606 16.947 18.2343V23.959H13.5188V13.1583ZM11.4658 13.1583H8.03759V23.959H11.4658V13.1583Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M4 16C4 21.9333 8.33333 26.8667 14 27.8667L14.0669 27.8132C14.0446 27.8088 14.0223 27.8045 14 27.8V19.3333H11V16H14V13.3333C14 10.3333 15.9333 8.66667 18.6667 8.66667C19.5333 8.66667 20.4667 8.8 21.3333 8.93333V12H19.8C18.3333 12 18 12.7333 18 13.6667V16H21.2L20.6667 19.3333H18V27.8C17.9777 27.8045 17.9554 27.8088 17.9331 27.8132L18 27.8667C23.6667 26.8667 28 21.9333 28 16C28 9.4 22.6 4 16 4C9.4 4 4 9.4 4 16Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M26.3615 10.7842C26.3706 11.0174 26.3736 11.2505 26.3736 11.4836C26.3736 18.5532 21.4004 26.7147 12.3063 26.7147C9.51278 26.7147 6.91518 25.8243 4.72656 24.3087C5.11344 24.3511 5.50635 24.3829 5.90528 24.3829C8.22152 24.3829 10.3549 23.5242 12.0471 22.0827C9.88358 22.0509 8.05673 20.4929 7.42667 18.3731C7.72914 18.4367 8.04063 18.4685 8.35917 18.4685C8.80835 18.4685 9.24447 18.405 9.66249 18.2778C7.39851 17.7903 5.69326 15.6281 5.69326 13.0313C5.69326 12.9995 5.69326 12.9889 5.69326 12.9677C6.36049 13.3598 7.12419 13.6035 7.93512 13.6353C6.60668 12.6708 5.73343 11.028 5.73343 9.17311C5.73343 8.19799 5.97661 7.27583 6.40469 6.48089C8.84251 9.72422 12.4872 11.8547 16.5962 12.0773C16.5117 11.6851 16.4685 11.2718 16.4685 10.8585C16.4685 7.90131 18.6822 5.50586 21.4135 5.50586C22.8354 5.50586 24.1196 6.1525 25.021 7.19121C26.1495 6.95803 27.2066 6.5129 28.1633 5.89815C27.7925 7.14884 27.0096 8.19794 25.9867 8.85508C26.9875 8.72789 27.9422 8.44194 28.8275 8.01797C28.1633 9.08848 27.3272 10.0317 26.3615 10.7842Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                </div>
                                <p class="about-item__text">
                                    Наш SMM-менеджер - настоящий гений в мире социальных медиа! Он знает, как заставить
                                    контент работать на свою аудиторию и привлечь больше подписчиков, чем у котиков на
                                    YouTube.
                                </p>
                            </div>
                            <div class="about__item about-item about-item--colored">
                                <img class="about-item__img" src="../../public/About/about-img-3.png" alt="img">
                                <p class="about-item__name">
                                    Женя Сохацкая
                                </p>
                                <p class="about-item__post">
                                    Автор
                                </p>
                                <div class="about-item__socials">
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M5.33073 5.33398H26.6641C28.1307 5.33398 29.3307 6.53398 29.3307 8.00065V24.0007C29.3307 25.4673 28.1307 26.6673 26.6641 26.6673H5.33073C3.86406 26.6673 2.66406 25.4673 2.66406 24.0007V8.00065C2.66406 6.53398 3.86406 5.33398 5.33073 5.33398Z"
                                                stroke="black" stroke-width="2.66667" stroke-linecap="round"
                                                stroke-linejoin="round" />
                                            <path d="M29.3307 8L15.9974 17.3333L2.66406 8" stroke="black"
                                                stroke-width="2.66667" stroke-linecap="round" stroke-linejoin="round" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M6.27295 4.66602C5.38439 4.66602 4.66406 5.38634 4.66406 6.2749V25.7237C4.66406 26.6123 5.38439 27.3326 6.27295 27.3326H25.7218C26.6104 27.3326 27.3307 26.6123 27.3307 25.7237V6.2749C27.3307 5.38634 26.6104 4.66602 25.7218 4.66602H6.27295ZM9.75169 11.7052C10.8377 11.7052 11.718 10.8248 11.718 9.73883C11.718 8.65286 10.8377 7.7725 9.75169 7.7725C8.66572 7.7725 7.78536 8.65286 7.78536 9.73883C7.78536 10.8248 8.66572 11.7052 9.75169 11.7052ZM13.5188 13.1583H16.7777V14.6512C16.7777 14.6512 17.662 12.8826 20.0681 12.8826C22.2145 12.8826 23.9926 13.9399 23.9926 17.1628V23.959H20.6155V17.9863C20.6155 16.0851 19.6005 15.876 18.827 15.876C17.2218 15.876 16.947 17.2606 16.947 18.2343V23.959H13.5188V13.1583ZM11.4658 13.1583H8.03759V23.959H11.4658V13.1583Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M4 16C4 21.9333 8.33333 26.8667 14 27.8667L14.0669 27.8132C14.0446 27.8088 14.0223 27.8045 14 27.8V19.3333H11V16H14V13.3333C14 10.3333 15.9333 8.66667 18.6667 8.66667C19.5333 8.66667 20.4667 8.8 21.3333 8.93333V12H19.8C18.3333 12 18 12.7333 18 13.6667V16H21.2L20.6667 19.3333H18V27.8C17.9777 27.8045 17.9554 27.8088 17.9331 27.8132L18 27.8667C23.6667 26.8667 28 21.9333 28 16C28 9.4 22.6 4 16 4C9.4 4 4 9.4 4 16Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M26.3615 10.7842C26.3706 11.0174 26.3736 11.2505 26.3736 11.4836C26.3736 18.5532 21.4004 26.7147 12.3063 26.7147C9.51278 26.7147 6.91518 25.8243 4.72656 24.3087C5.11344 24.3511 5.50635 24.3829 5.90528 24.3829C8.22152 24.3829 10.3549 23.5242 12.0471 22.0827C9.88358 22.0509 8.05673 20.4929 7.42667 18.3731C7.72914 18.4367 8.04063 18.4685 8.35917 18.4685C8.80835 18.4685 9.24447 18.405 9.66249 18.2778C7.39851 17.7903 5.69326 15.6281 5.69326 13.0313C5.69326 12.9995 5.69326 12.9889 5.69326 12.9677C6.36049 13.3598 7.12419 13.6035 7.93512 13.6353C6.60668 12.6708 5.73343 11.028 5.73343 9.17311C5.73343 8.19799 5.97661 7.27583 6.40469 6.48089C8.84251 9.72422 12.4872 11.8547 16.5962 12.0773C16.5117 11.6851 16.4685 11.2718 16.4685 10.8585C16.4685 7.90131 18.6822 5.50586 21.4135 5.50586C22.8354 5.50586 24.1196 6.1525 25.021 7.19121C26.1495 6.95803 27.2066 6.5129 28.1633 5.89815C27.7925 7.14884 27.0096 8.19794 25.9867 8.85508C26.9875 8.72789 27.9422 8.44194 28.8275 8.01797C28.1633 9.08848 27.3272 10.0317 26.3615 10.7842Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                </div>
                                <p class="about-item__text">
                                    Наш SMM-менеджер - настоящий гений в мире социальных медиа! Он знает, как заставить
                                    контент работать на свою аудиторию и привлечь больше подписчиков, чем у котиков на
                                    YouTube.
                                </p>
                            </div>
                            <div class="about__item about-item about-item">
                                <img class="about-item__img" src="../../public/About/about-img-4.png" alt="img">
                                <p class="about-item__name">
                                    Диана Киенко
                                </p>
                                <p class="about-item__post">
                                    Старший редактор
                                </p>
                                <div class="about-item__socials">
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M5.33073 5.33398H26.6641C28.1307 5.33398 29.3307 6.53398 29.3307 8.00065V24.0007C29.3307 25.4673 28.1307 26.6673 26.6641 26.6673H5.33073C3.86406 26.6673 2.66406 25.4673 2.66406 24.0007V8.00065C2.66406 6.53398 3.86406 5.33398 5.33073 5.33398Z"
                                                stroke="black" stroke-width="2.66667" stroke-linecap="round"
                                                stroke-linejoin="round" />
                                            <path d="M29.3307 8L15.9974 17.3333L2.66406 8" stroke="black"
                                                stroke-width="2.66667" stroke-linecap="round" stroke-linejoin="round" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M6.27295 4.66602C5.38439 4.66602 4.66406 5.38634 4.66406 6.2749V25.7237C4.66406 26.6123 5.38439 27.3326 6.27295 27.3326H25.7218C26.6104 27.3326 27.3307 26.6123 27.3307 25.7237V6.2749C27.3307 5.38634 26.6104 4.66602 25.7218 4.66602H6.27295ZM9.75169 11.7052C10.8377 11.7052 11.718 10.8248 11.718 9.73883C11.718 8.65286 10.8377 7.7725 9.75169 7.7725C8.66572 7.7725 7.78536 8.65286 7.78536 9.73883C7.78536 10.8248 8.66572 11.7052 9.75169 11.7052ZM13.5188 13.1583H16.7777V14.6512C16.7777 14.6512 17.662 12.8826 20.0681 12.8826C22.2145 12.8826 23.9926 13.9399 23.9926 17.1628V23.959H20.6155V17.9863C20.6155 16.0851 19.6005 15.876 18.827 15.876C17.2218 15.876 16.947 17.2606 16.947 18.2343V23.959H13.5188V13.1583ZM11.4658 13.1583H8.03759V23.959H11.4658V13.1583Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M4 16C4 21.9333 8.33333 26.8667 14 27.8667L14.0669 27.8132C14.0446 27.8088 14.0223 27.8045 14 27.8V19.3333H11V16H14V13.3333C14 10.3333 15.9333 8.66667 18.6667 8.66667C19.5333 8.66667 20.4667 8.8 21.3333 8.93333V12H19.8C18.3333 12 18 12.7333 18 13.6667V16H21.2L20.6667 19.3333H18V27.8C17.9777 27.8045 17.9554 27.8088 17.9331 27.8132L18 27.8667C23.6667 26.8667 28 21.9333 28 16C28 9.4 22.6 4 16 4C9.4 4 4 9.4 4 16Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M26.3615 10.7842C26.3706 11.0174 26.3736 11.2505 26.3736 11.4836C26.3736 18.5532 21.4004 26.7147 12.3063 26.7147C9.51278 26.7147 6.91518 25.8243 4.72656 24.3087C5.11344 24.3511 5.50635 24.3829 5.90528 24.3829C8.22152 24.3829 10.3549 23.5242 12.0471 22.0827C9.88358 22.0509 8.05673 20.4929 7.42667 18.3731C7.72914 18.4367 8.04063 18.4685 8.35917 18.4685C8.80835 18.4685 9.24447 18.405 9.66249 18.2778C7.39851 17.7903 5.69326 15.6281 5.69326 13.0313C5.69326 12.9995 5.69326 12.9889 5.69326 12.9677C6.36049 13.3598 7.12419 13.6035 7.93512 13.6353C6.60668 12.6708 5.73343 11.028 5.73343 9.17311C5.73343 8.19799 5.97661 7.27583 6.40469 6.48089C8.84251 9.72422 12.4872 11.8547 16.5962 12.0773C16.5117 11.6851 16.4685 11.2718 16.4685 10.8585C16.4685 7.90131 18.6822 5.50586 21.4135 5.50586C22.8354 5.50586 24.1196 6.1525 25.021 7.19121C26.1495 6.95803 27.2066 6.5129 28.1633 5.89815C27.7925 7.14884 27.0096 8.19794 25.9867 8.85508C26.9875 8.72789 27.9422 8.44194 28.8275 8.01797C28.1633 9.08848 27.3272 10.0317 26.3615 10.7842Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                </div>
                                <p class="about-item__text">
                                    Наш SMM-менеджер - настоящий гений в мире социальных медиа! Он знает, как заставить
                                    контент работать на свою аудиторию и привлечь больше подписчиков, чем у котиков на
                                    YouTube.
                                </p>
                            </div>
                            <div class="about__item about-item about-item--colored">
                                <img class="about-item__img" src="../../public/About/about-img-5.png" alt="img">
                                <p class="about-item__name">
                                    Влад Антоненко
                                </p>
                                <p class="about-item__post">
                                    Младший редактор
                                </p>
                                <div class="about-item__socials">
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M5.33073 5.33398H26.6641C28.1307 5.33398 29.3307 6.53398 29.3307 8.00065V24.0007C29.3307 25.4673 28.1307 26.6673 26.6641 26.6673H5.33073C3.86406 26.6673 2.66406 25.4673 2.66406 24.0007V8.00065C2.66406 6.53398 3.86406 5.33398 5.33073 5.33398Z"
                                                stroke="black" stroke-width="2.66667" stroke-linecap="round"
                                                stroke-linejoin="round" />
                                            <path d="M29.3307 8L15.9974 17.3333L2.66406 8" stroke="black"
                                                stroke-width="2.66667" stroke-linecap="round" stroke-linejoin="round" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M6.27295 4.66602C5.38439 4.66602 4.66406 5.38634 4.66406 6.2749V25.7237C4.66406 26.6123 5.38439 27.3326 6.27295 27.3326H25.7218C26.6104 27.3326 27.3307 26.6123 27.3307 25.7237V6.2749C27.3307 5.38634 26.6104 4.66602 25.7218 4.66602H6.27295ZM9.75169 11.7052C10.8377 11.7052 11.718 10.8248 11.718 9.73883C11.718 8.65286 10.8377 7.7725 9.75169 7.7725C8.66572 7.7725 7.78536 8.65286 7.78536 9.73883C7.78536 10.8248 8.66572 11.7052 9.75169 11.7052ZM13.5188 13.1583H16.7777V14.6512C16.7777 14.6512 17.662 12.8826 20.0681 12.8826C22.2145 12.8826 23.9926 13.9399 23.9926 17.1628V23.959H20.6155V17.9863C20.6155 16.0851 19.6005 15.876 18.827 15.876C17.2218 15.876 16.947 17.2606 16.947 18.2343V23.959H13.5188V13.1583ZM11.4658 13.1583H8.03759V23.959H11.4658V13.1583Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M4 16C4 21.9333 8.33333 26.8667 14 27.8667L14.0669 27.8132C14.0446 27.8088 14.0223 27.8045 14 27.8V19.3333H11V16H14V13.3333C14 10.3333 15.9333 8.66667 18.6667 8.66667C19.5333 8.66667 20.4667 8.8 21.3333 8.93333V12H19.8C18.3333 12 18 12.7333 18 13.6667V16H21.2L20.6667 19.3333H18V27.8C17.9777 27.8045 17.9554 27.8088 17.9331 27.8132L18 27.8667C23.6667 26.8667 28 21.9333 28 16C28 9.4 22.6 4 16 4C9.4 4 4 9.4 4 16Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M26.3615 10.7842C26.3706 11.0174 26.3736 11.2505 26.3736 11.4836C26.3736 18.5532 21.4004 26.7147 12.3063 26.7147C9.51278 26.7147 6.91518 25.8243 4.72656 24.3087C5.11344 24.3511 5.50635 24.3829 5.90528 24.3829C8.22152 24.3829 10.3549 23.5242 12.0471 22.0827C9.88358 22.0509 8.05673 20.4929 7.42667 18.3731C7.72914 18.4367 8.04063 18.4685 8.35917 18.4685C8.80835 18.4685 9.24447 18.405 9.66249 18.2778C7.39851 17.7903 5.69326 15.6281 5.69326 13.0313C5.69326 12.9995 5.69326 12.9889 5.69326 12.9677C6.36049 13.3598 7.12419 13.6035 7.93512 13.6353C6.60668 12.6708 5.73343 11.028 5.73343 9.17311C5.73343 8.19799 5.97661 7.27583 6.40469 6.48089C8.84251 9.72422 12.4872 11.8547 16.5962 12.0773C16.5117 11.6851 16.4685 11.2718 16.4685 10.8585C16.4685 7.90131 18.6822 5.50586 21.4135 5.50586C22.8354 5.50586 24.1196 6.1525 25.021 7.19121C26.1495 6.95803 27.2066 6.5129 28.1633 5.89815C27.7925 7.14884 27.0096 8.19794 25.9867 8.85508C26.9875 8.72789 27.9422 8.44194 28.8275 8.01797C28.1633 9.08848 27.3272 10.0317 26.3615 10.7842Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                </div>
                                <p class="about-item__text">
                                    Наш SMM-менеджер - настоящий гений в мире социальных медиа! Он знает, как заставить
                                    контент работать на свою аудиторию и привлечь больше подписчиков, чем у котиков на
                                    YouTube.
                                </p>
                            </div>
                            <div class="about__item about-item about-item">
                                <img class="about-item__img" src="../../public/About/about-img-6.png" alt="img">
                                <p class="about-item__name">
                                    София Остапенко
                                </p>
                                <p class="about-item__post">
                                    Контент менеджер
                                </p>
                                <div class="about-item__socials">
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M5.33073 5.33398H26.6641C28.1307 5.33398 29.3307 6.53398 29.3307 8.00065V24.0007C29.3307 25.4673 28.1307 26.6673 26.6641 26.6673H5.33073C3.86406 26.6673 2.66406 25.4673 2.66406 24.0007V8.00065C2.66406 6.53398 3.86406 5.33398 5.33073 5.33398Z"
                                                stroke="black" stroke-width="2.66667" stroke-linecap="round"
                                                stroke-linejoin="round" />
                                            <path d="M29.3307 8L15.9974 17.3333L2.66406 8" stroke="black"
                                                stroke-width="2.66667" stroke-linecap="round" stroke-linejoin="round" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M6.27295 4.66602C5.38439 4.66602 4.66406 5.38634 4.66406 6.2749V25.7237C4.66406 26.6123 5.38439 27.3326 6.27295 27.3326H25.7218C26.6104 27.3326 27.3307 26.6123 27.3307 25.7237V6.2749C27.3307 5.38634 26.6104 4.66602 25.7218 4.66602H6.27295ZM9.75169 11.7052C10.8377 11.7052 11.718 10.8248 11.718 9.73883C11.718 8.65286 10.8377 7.7725 9.75169 7.7725C8.66572 7.7725 7.78536 8.65286 7.78536 9.73883C7.78536 10.8248 8.66572 11.7052 9.75169 11.7052ZM13.5188 13.1583H16.7777V14.6512C16.7777 14.6512 17.662 12.8826 20.0681 12.8826C22.2145 12.8826 23.9926 13.9399 23.9926 17.1628V23.959H20.6155V17.9863C20.6155 16.0851 19.6005 15.876 18.827 15.876C17.2218 15.876 16.947 17.2606 16.947 18.2343V23.959H13.5188V13.1583ZM11.4658 13.1583H8.03759V23.959H11.4658V13.1583Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M4 16C4 21.9333 8.33333 26.8667 14 27.8667L14.0669 27.8132C14.0446 27.8088 14.0223 27.8045 14 27.8V19.3333H11V16H14V13.3333C14 10.3333 15.9333 8.66667 18.6667 8.66667C19.5333 8.66667 20.4667 8.8 21.3333 8.93333V12H19.8C18.3333 12 18 12.7333 18 13.6667V16H21.2L20.6667 19.3333H18V27.8C17.9777 27.8045 17.9554 27.8088 17.9331 27.8132L18 27.8667C23.6667 26.8667 28 21.9333 28 16C28 9.4 22.6 4 16 4C9.4 4 4 9.4 4 16Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                    <a class="about-item__socials-link" href="#">
                                        <svg width="32" height="32" viewBox="0 0 32 32" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                d="M26.3615 10.7842C26.3706 11.0174 26.3736 11.2505 26.3736 11.4836C26.3736 18.5532 21.4004 26.7147 12.3063 26.7147C9.51278 26.7147 6.91518 25.8243 4.72656 24.3087C5.11344 24.3511 5.50635 24.3829 5.90528 24.3829C8.22152 24.3829 10.3549 23.5242 12.0471 22.0827C9.88358 22.0509 8.05673 20.4929 7.42667 18.3731C7.72914 18.4367 8.04063 18.4685 8.35917 18.4685C8.80835 18.4685 9.24447 18.405 9.66249 18.2778C7.39851 17.7903 5.69326 15.6281 5.69326 13.0313C5.69326 12.9995 5.69326 12.9889 5.69326 12.9677C6.36049 13.3598 7.12419 13.6035 7.93512 13.6353C6.60668 12.6708 5.73343 11.028 5.73343 9.17311C5.73343 8.19799 5.97661 7.27583 6.40469 6.48089C8.84251 9.72422 12.4872 11.8547 16.5962 12.0773C16.5117 11.6851 16.4685 11.2718 16.4685 10.8585C16.4685 7.90131 18.6822 5.50586 21.4135 5.50586C22.8354 5.50586 24.1196 6.1525 25.021 7.19121C26.1495 6.95803 27.2066 6.5129 28.1633 5.89815C27.7925 7.14884 27.0096 8.19794 25.9867 8.85508C26.9875 8.72789 27.9422 8.44194 28.8275 8.01797C28.1633 9.08848 27.3272 10.0317 26.3615 10.7842Z"
                                                fill="black" />
                                        </svg>
                                    </a>
                                </div>
                                <p class="about-item__text">
                                    Наш SMM-менеджер - настоящий гений в мире социальных медиа! Он знает, как заставить
                                    контент работать на свою аудиторию и привлечь больше подписчиков, чем у котиков на
                                    YouTube.
                                </p>
                            </div>
                        </div>
                    </div>
                </section>
            </main>
        </div>
        <Footer/>
    </div>
</template>

<script>
import Header from '../components/Main-components/Header.vue';
import BreadCrumbsVue from '../components/Main-components/BreadCrumbs.vue';
import Footer from '../components/Main-components/Footer.vue';
export default {
    components: {
        Header,
        BreadCrumbsVue,
        Footer
    },
    data() {
        return {
            BreadCrumbsLink: 'Наша команда'
        }
    }
}
</script>

<style lang="scss">
.about {
    padding-top: 60px;
    padding-bottom: 220px;
    &__title {
        font-family: "Rubik", sans-serif;
        padding-bottom: 15px;
        font-weight: 600;
        font-size: 32px;
        line-height: 38px;
        margin-bottom: 15px;
        text-align: center;
        color: #000000;
        max-width: 805px;
        margin-left: auto;
        margin-right: auto;
        position: relative;

        &::after {
            content: '';
            width: 60px;
            height: 4px;
            position: absolute;
            bottom: 0;
            left: 50%;
            transform: translateX(-50%);
            background: #007F5F;
            border-radius: 50px;
        }
    }

    &__text {
        font-size: 20px;
        line-height: 27px;
        text-align: center;
        color: #000000;
        margin-bottom: 120px;
        max-width: 805px;
        margin-left: auto;
        margin-right: auto;
    }

    &__inner {
        display: grid;
        gap: 35px;
        grid-template-columns: 1fr 1fr 1fr;
    }
}

.about-item {
    display: flex;
    flex-direction: column;
    align-items: center;
    justify-content: center;
    text-align: center;
    background: #FFFFFF;
    box-shadow: 0px 2px 22px rgba(0, 0, 0, 0.12);
    border-radius: 16px;
    padding: 30px 25px;
    &:nth-child(2) {
        transform: translateY(-70px);
    }
    &:nth-child(5) {
        transform: translateY(-70px);
    }
    &__img {
        display: block;
        margin-bottom: 30px;
    }

    &__name {
        font-family: "Rubik", sans-serif;
        font-weight: 600;
        font-size: 28px;
        line-height: 33px;
        margin-bottom: 5px;
        color: #000000;
    }

    &__post {
        background: linear-gradient(126.06deg, #DCF9FF 0%, #FFF5EC 100%);
        padding: 10px 20px;
        font-size: 20px;
        line-height: 22px;
        color: #000000;
        border-radius: 47px;
        margin-bottom: 15px;
    }

    &__socials {
        display: flex;
        align-items: center;
        gap: 10px;
        margin-bottom: 30px;
    }

    &__socials-link {
        display: flex;
        padding: 8px;
        justify-content: center;
        align-items: center;
        background: rgba(255, 255, 255, 0.5);
        border: 0.8px solid #EBEBEB;
        border-radius: 5px;
    }

    &__text {
        font-size: 18px;
        line-height: 25px;
        text-align: center;
        color: #000000;
    }
}

.about-item--colored {
    background: linear-gradient(126.06deg, #F2F4FF 0%, #E4FFF8 100%);
    border-radius: 16px;
    box-shadow: unset;

    .about-item__post {
        background: #fff;
    }
}
</style>